tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "sass/sass"
brew "glib"
brew "cairo"
brew "libtiff"
brew "gdk-pixbuf"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "arp-scan"
brew "ast-grep"
brew "autoenv"
brew "libgit2"
brew "bat"
brew "bundler-completion"
brew "chafa"
brew "dos2unix"
brew "duti"
brew "erlang"
brew "eza"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "git"
brew "git-lfs"
brew "go"
brew "graphene"
brew "gtk4"
brew "htop"
brew "hugo"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "node"
brew "jupyterlab"
brew "krb5"
brew "lazygit"
brew "lesspipe"
brew "libfido2"
brew "lua"
brew "luarocks"
brew "mkcert"
brew "mongosh"
brew "mysql@8.4", link: true
brew "neovim"
brew "nss"
brew "numpy"
brew "nvm"
brew "openjdk", link: true
brew "openvino"
brew "perl"
brew "pipenv"
brew "pkgconf"
brew "pngpaste"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "protolint"
brew "pyenv"
brew "pygments"
brew "python-yq"
brew "rabbitmq"
brew "redis"
brew "resvg"
brew "ripgrep"
brew "rush"
brew "rustup"
brew "sevenzip"
brew "starship"
brew "texlive"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "sass/sass/sass"
cask "1password-cli"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "gstreamer-runtime"
cask "keycastr"
cask "ngrok"
cask "raycast"
cask "wezterm"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.path-intellisense"
vscode "cipchk.cssrem"
vscode "cmstead.jsrefactor"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "iocave.customize-ui"
vscode "iocave.monkey-patch"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-protolint"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "sburg.vscode-javascript-booster"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sidthesloth.html5-boilerplate"
vscode "steoates.autoimport"
vscode "syler.sass-indented"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "william-voyek.vscode-nginx"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
